src/CF/Catalogs/Поставщики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Поставщики</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Клиенты</xr:Item>
				<xr:Item>Catalog.Производители</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйИндекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравовойСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравовойСтатус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыВДняхПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Локации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯзыкОбщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯзыкДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/AccumulationRegisters/РасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CF/Catalogs/Поставщики/Ext/ManagerModule.bsl
//sza141216-0234
//sza140710-1755  локац
//sza140104-0215 : 
//sza131021-0148 : 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , ИСТИНА);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ДляУскоренияРаботыСБазойДанныхНеВыводитьДополнительныхДанных") Тогда
		
		Если ВидФормы = "ФормаСписка" Тогда
			
			ВыбраннаяФорма = ВидФормы + "Упрощенная";
			СтандартнаяОбработка = ЛОЖЬ;
			
		ИначеЕсли ВидФормы = "ФормаВыбора" тогда
			
			ВыбраннаяФорма = ВидФормы + "Упрощенная";
			СтандартнаяОбработка = ЛОЖЬ;
			
		ИначеЕсли ВидФормы = "ФормаОбъекта" Тогда

			ВыбраннаяФорма = "ФормаЭлементаУпрощенная";
			СтандартнаяОбработка = ЛОЖЬ;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	ЭлементСправочника = ссылка[0];
	
	ТабДок.Очистить();	
	ТабДок.Начатьавтогруппировкустрок();
	
	Макет = Справочники.Поставщики.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Шапка = Макет.ПолучитьОбласть("Ш");
	Шапка.параметры.заполнить(ЭлементСправочника);
	
	СтруктураДополнительныПараметровМакета = ОбщийМодульСервер.ПолучитьСтруктуруДополнительныхПараметровМакетаПечати();
	Шапка.Параметры.ТекстВШапкеДокументовПриПечати   = СтруктураДополнительныПараметровМакета.ТекстВШапкеДокументовПриПечати;
	
	Если НЕ ЗначениеЗаполнено(ЭлементСправочника.НаименованиеДляПечати) Тогда
		Шапка.Параметры.НаименованиеДляПечати = ЭлементСправочника.наименование;
	КонецЕсли;
	
	Регион  = ОбщийМодульПовтор.ПолучитьПредставлениеНаЯзыке(ЭлементСправочника.Регион, , ИСТИНА, ЭлементСправочника.ЯзыкДокументов);
	Если Регион = Неопределено Тогда
		Регион = СокрЛП(ЭлементСправочника.Регион);
	КонецЕсли;		
	Локация = ОбщийМодульПовтор.ПолучитьПредставлениеНаЯзыке(ЭлементСправочника.Локация, , ИСТИНА, ЭлементСправочника.ЯзыкДокументов);
	Если Локация = Неопределено Тогда
		Локация = СокрЛП(ЭлементСправочника.Локация);
	КонецЕсли;		
	
	ВыборкаАдрес = СокрЛП(ЭлементСправочника.адрес);
	Если Найти(ВыборкаАдрес, "" + СокрЛП(Регион)) = 0 Тогда
		Адрес = "" + СокрЛП(Регион) + ?(ЗначениеЗаполнено(Локация), ", " + СокрЛП(Локация), "") + ", " + ВыборкаАдрес;
	Иначе
		Адрес = ВыборкаАдрес;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ЭлементСправочника.ЮридическийАдрес)
		И НЕ ВыборкаАдрес = СокрЛП(ЭлементСправочника.ЮридическийАдрес) Тогда
		
		Адрес = Адрес + ", " + ЭлементСправочника.ЮридическийАдрес;
	КонецЕсли;
	
	Шапка.Параметры.РегионАдрес = Адрес;
	
	ПолныйНомерТелефона = ОбщийМодульСервер.СоставитьТелефон(ЭлементСправочника, ИСТИНА);
	
	Шапка.Параметры.Телефон = ПолныйНомерТелефона;
	
	ТабДок.Вывести(Шапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РасчетыСПоставщиками.Период КАК ДАТА,
	|	РасчетыСПоставщиками.Регистратор,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщиками.ВидДвижения = &Приход
	|			ТОГДА РасчетыСПоставщиками.Сумма
	|		Иначе 0
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщиками.ВидДвижения = &Приход
	|			ТОГДА 0
	|		Иначе РасчетыСПоставщиками.Сумма
	|	КОНЕЦ КАК Оплачено
	|ИЗ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|ГДЕ РасчетыСПоставщиками.Поставщик = &Поставщик
	|	И РасчетыСПоставщиками.Период <= &Период
	|УПОРЯДОЧИТЬ ПО ДАТА";
	
	Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);	
	Запрос.УстановитьПараметр("Поставщик", ЭлементСправочника);
	Запрос.УстановитьПараметр("Период", ОбщийМодульСервисСервер.ПользователяТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса .Пустой() Тогда
		
		Шапка  = Макет.ПолучитьОбласть("ШД");
		Подвал = Макет.ПолучитьОбласть("П");
		Строка = Макет.ПолучитьОбласть("С");
		ОсновнаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
		Шапка.Параметры.ВалютаПрограммы = ОсновнаяВалюта.Наименование;
		
		Шапка.Параметры.текущийдолг = ОбщийМодульСервер.ПолучитьДолгКлиентаПоставщика(ЭлементСправочника, ОбщийМодульСервисСервер.ПользователяТекущаяДата());
		ТабДок.Вывести(Шапка, 0);
		
		Если  ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетОтдельныхДоговоровСКонтрагентами") Тогда
		Шапка  = Макет.ПолучитьОбласть("ШДК");
		Шапка.Параметры.ПросроченныйДолг = ОбщийМодульСервер.ПолучитьДолгКлиентаПоставщикаСОтсрочкой(ЭлементСправочника, ОбщийМодульСервисСервер.ПользователяТекущаяДата());
		Шапка.Параметры.ВалютаПрограммы  = ОсновнаяВалюта.Наименование;
		ТабДок.Вывести(Шапка, 0);
		КонецЕсли;
		
		ТаблицаРезультат = РезультатЗапроса.Выгрузить();
		
		ТаблицаРезультат.Свернуть("Регистратор, Дата", "Сумма, Оплачено");
		ТаблицаРезультат.Сортировать("Дата");
		ТаблицаРезультат.Колонки.Добавить("Остаток");
		ТаблицаРезультат.Колонки.Добавить("Количество");
		остаток = 0;
		
		Для Каждого строкарезультата из ТаблицаРезультат цикл
			остаток = остаток + строкарезультата.сумма - строкарезультата.оплачено;
			строкарезультата.остаток = остаток;
			Если ТипЗнч(строкарезультата.регистратор) = Тип("ДокументСсылка.РасходыТовара") 
				ИЛИ ТипЗнч(строкарезультата.регистратор) = Тип("ДокументСсылка.ПоступленияТовара") Тогда
				
				строкарезультата.количество = строкарезультата.регистратор.товары.итог("количество");
			КонецЕсли;
			строка.Параметры.Заполнить(строкарезультата);
			ТабДок.Вывести(строка, 1);
		КонецЦикла;
		
		Подвал.Параметры.Сумма = ТаблицаРезультат.Итог("Сумма");
		Подвал.Параметры.Количество = ТаблицаРезультат.Итог("Количество");
		Подвал.Параметры.Оплачено = ТаблицаРезультат.Итог("Оплачено");
		
		Подвал.Параметры.ТекстВПодвалеДокументовПриПечати = СтруктураДополнительныПараметровМакета.ТекстВПодвалеДокументовПриПечати;
		ТабДок.Вывести(Подвал, 0);
		
	КонецЕсли;
	
	ТабДок.Закончитьавтогруппировкустрок();
	
	ТабДок.ОтображатьСетку 	= ЛОЖЬ;
	ТабДок.Защита 			= ИСТИНА;
	ТабДок.ТолькоПросмотр 	= ИСТИНА;
	ТабДок.ОтображатьЗаголовки = ЛОЖЬ;  	
	
КонецПроцедуры
